src/Catalogs/НастройкиПодключения/НастройкиПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПодключения</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяАвторизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/НастройкиПодключения/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПолейАвторизации();
КонецПроцедуры

#КонецОбласти

#область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТребуетсяАвторизацияПриИзменении(Элемент)
	УстановитьДоступностьПолейАвторизации();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьПолейАвторизации()

	Если Объект.ТребуетсяАвторизация Тогда
		Элементы.Логин.ТолькоПросмотр = Ложь;
		Элементы.Пароль.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Логин.ТолькоПросмотр = Истина;
		Элементы.Пароль.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
